# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSizeSet..::..Erase Method
PaperSizeSet Class See Also
---
Removes a specified object from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	PaperSize item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As PaperSize _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	PaperSize^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PaperSizeThe item to be erased.
# ### Return Value
The number of items that were erased from the set.
# See Also
PaperSizeSet Class
Autodesk.Revit.DB Namespace